// const fs = require('fs')
import fs from 'fs'
import path from 'path'
export let Zikr = [
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'لا ننسي الدعاء للاهل وذوي القربي والاصحاب بصلاح الحال والتوفيق والهداية وطلب الشفاء للمريض و طلب الرحمة للمتوفي',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: null,
    title: 'main',
    header: 'الدعاء بعد ركعتي الطواف',
    description:
      'لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ، لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: null,
    title: 'main',
    header: 'الدُّعاءُ بينَ الرُّكن اليماني والحجر الأسود',
    description: 'رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللهم انت ربي لا اله الا انت
  خلقتني وانا عبدك
  وانا على عهدك ووعدك ما استطعت
  اعوذ بك من شر ما صنعت
  ابوء لك بنعمتك علي
  وابوء بذنبي
  فاغفر لي فانه لا يغفر الذنوب الا انت`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `لا اله الا الله الحليم الكريم
     سبحان رب العرش العظيم الحمد لله رب العالمين
     اللهم اني اسالك موجبات رحمتك
     وعزائم مغفرتك والغنيمه من كل بر والسلامه من كل اثم
     اللهم لا تدع لي ذنبا الا غفرته ولا هما الا فرجته
     ولا حاجه هي لك رضا الا قضيتها يا رب العالمين يا ارحم الراحمين`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللهم لك الحمد انت نور السماوات والارض ومن فيهن
  ولك الحمد انت قيوم السماوات والارض ومن فيهن
  ولك الحمد انت الحق و وعدك حق وقولك حق والجنه حق والنار حق
  والساعه حق والنبيون حق ومحمد حق
  اللهم لك اسلمت و عليك توكلت
  وبك امنت واليك انبت
  فاغفر لي ما قدمت وما اخرت
  وما اسررت وما اعلنت
  انت المقدم وانت المؤخر لا اله الا انت`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'اللهم لك الحمد كله واليك يرجع الامر كله علانيته وسره فانت حق من يعبد وانت حق من يحمد وانت على كل شيء قدير',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللهم لك اسلمت وعليك توكلت
  وبك امنت واليك انبت وبك خاصمت واليك حاكمت
  فاغفر لي ما قدمت وما اخرت وما اسررت وما اعلنت`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `الحمد لله الذي من علينا بالاسلام الحمد لله رب العالمين
    الحمد لله الذي له ما في السماوات وما في الارض
    وله الحمد في الدنيا وفي الاخره وهو الحكيم الخبير`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ
    وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ، عَاجِلِهِ وَآَجِلِهِ مَا عَلِمْتُ مِنْهُ، وَمَا لَمْ أَعْلَمْ
    اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ
    وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ
    اللهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ تَقْضِيهِ لِي خَيْرًا`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: null,
    title: 'zikr',
    header: 'ذكر',
    description:
      'آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ (285) لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ (286)',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'ايه الكرسي',
    description:
      'اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى null البقرة 255].  (من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.)',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'المعوذتان والفاتحة',
    description:
      'قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.  (من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).)',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: null,
    title: 'zikr',
    header: 'اذكار الصباح',
    description: `أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله
  لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد وهُوَ على كلّ شَيءٍ قدير
  رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه
  وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه
  رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر
  رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'اذكار الصباح',
    description: `اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك
  وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت
  أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت
  أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي
  فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'اذكار الصباح',
    description: `رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً
  (من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'اذكار الصباح',
    description: `اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك
  وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك
  أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك
  وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك
  (من قالها أعتقه الله من النار.)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'اذكار الصباح',
    description: `حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم
  (من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'اذكار الصباح',
    description: `اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك
  فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك
  فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر
  (من قالها حين يصبح أدى شكر يومه.)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: 'elMasgedElNabawy',
    title: 'doaa',
    header: 'دعاء دخول المسجد',
    description: `بسم الله والصلاة والسلام على رسول الله،
    أعوذ بالله العظيم وبوجهه الكريم
    وسلطانه القديم من الشيطان الرجيم
    اللهم افتح لي أبواب رحمتك`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: 'elMasgedElNabawy',
    title: 'doaa',
    header: 'دعاء دخول المسجد',
    description: `بسم الله والصلاة والسلام على رسول الله،
  أعوذ بالله العظيم وبوجهه الكريم
  وسلطانه القديم من الشيطان الرجيم
  اللهم افتح لي أبواب رحمتك`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: null,
    title: 'zikr',
    header: 'ذكر',
    description: `عَنْ أُبَيِّ بْنِ كَعْبٍ رضي الله عنه قَالَ :
    قُلْتُ : يَا رَسُولَ اللَّهِ إِنِّي أُكْثِرُ الصَّلَاةَ عَلَيْكَ فَكَمْ أَجْعَلُ لَكَ مِنْ صَلَاتِي ؟
    فَقَالَ : مَا شِئْتَ . قَالَ قُلْتُ الرُبُعَ ؟
    قَالَ : مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ . قُلْتُ النِّصْفَ ؟
    قَالَ : مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ . قَالَ قُلْتُ فَالثُّلُثَيْنِ ؟
    قَالَ : مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ . قُلْتُ أَجْعَلُ لَكَ صَلَاتِي كُلَّهَا ؟
    قَالَ : إِذًا تُكْفَى هَمَّكَ وَيُغْفَرُ لَكَ ذَنْبُكَ`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: null,
    header: `الشهادة`,
    description: `أشهد أن لا إله إلا الله وحده لا شريك له
    ولا ولد له ، ولا والد له ، ولا صاحبة له ، ولا نظير له
    ولا وزير ولا مشير له ، ولا عديد ولا نديد ولا قسيم
    وأشهد أنَّ محمداً عبده ورسوله ، وحبيبه وخليله
    المصطفى من خُلاصة العرب العَرْباء من الصميم ، خاتم الأنبياء
    وصاحب الحوض الأكبر الرَّواء
    صاحب الشفاعة العظمى يوم القيامة
    حامل اللواء الذي يبعثه الله تعالى المقام المحمود الذي يرغب إليه فيه الخلقُ كلُّهم
    حتى الخليل إبراهيم وعلى سائر إخوانه من النبيين والمرسلين
    وسلَّم وشرَّف وكرَّم أزكى صلاةٍ وتسليم
    وأعلى تشريف وتكريم
    ورضي الله عن جميع أصحابه الغرّ الكرام
    السادة النجباء الأعلام
    خلاصة العالم بعد الأنبياء
    ما اختلط الظلام بالضياء
    وما أعلن الداعي بالنداء
    وما نسخ النهار ظلام الليل البهيم`,
    status: 'Harm',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: null,
    header: `الدعاء الجامع`,
    description: `اللهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ
    وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ، عَاجِلِهِ وَآَجِلِهِ مَا عَلِمْتُ مِنْهُ، وَمَا لَمْ أَعْلَمْ
    اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ
    وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ
    اللهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ تَقْضِيهِ لِي خَيْرًا`,
    status: 'Harm',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: null,
    header: `دعاء`,
    description: `اللهم اني قد جئتك عاص فاغفرلي
    اللهم اني جئتك نادم فتب علي
    اللهم جئتك مذنب فاهدني وارحمن
    اللهم رضاك والجنة
    اللهم اني اسالك ان ترضي
    اللهم اني اسالك ان ترضي
    اللهم اغفر لي
    اللهم تب علي
    اللهم اهدني
    اللهم قربني اليك
    اللهم اهدني اليك
    اللهم انك تعلم ان غاية مطلبي رضاك
    فلا تردني
    انت ارحم الراحمين
    انت ربي وانا عبدك
    شهدت لك بالوحدانية
    وشهدت لرسولك بالنبوة
    وقبلت بالاسلام دينا
    فان كنت قد عصيتك
    فضعف مني و تقصير
    وانت الغفور الرحيم الحليم الكريم
    اغفرلي مع من غفرت لهم
    وتب علي مع من تبت عليهم
    اللهم ان رددتني فما غايتي فى المحي والممات
    من سواك لي
    رب اشهدتنا انك عند ظن عبادك بك
    وظني فيك يارب انت التواب الجواد الكريم
    ظن فيك يارب انك اللطيف الغفور الرحمن الرحيم
    تقبلني وتب علي
    `,
    status: 'Harm',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: null,
    header: `دعاء`,
    description: `اللهم اني اشهدك اني اشهد انه لا اله الا انت
    انت الاول والاخر والظاهر والباطن
    انت العظيم القوي القدير
    لا يعجزك شي
    لا اله الا انت رب العالمين
    `,
    status: 'Harm',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: null,
    header: `دعاء`,
    description: `اللهم اني اسالك من فضلك الواسع الكريم
    وانت الكريم
    اللهم اني اسالك رزقا حلالا طيبا كثيرا كثيرا مباركا فيه
    اللهم اني اسالك ان تغنين بحلالك عن حرامك
    اللهم بارك لي فى ما رزقتني
    اللهم افتح علي من خزائن رحمتك
    اللهم ارزقني من حيث لا احتسب
    اللهم ارزقني بجودك وكرمك
    وانت الجواد الكريم
    اللهم ارزقني و ارزقني و ارزقني وبارك لي في رزقي
    `,
    status: 'Harm',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: null,
    header: `دعاء`,
    description: `اللهم ارزقني الزوجة الصالحة
    اللهم ارزقني الزوجة الصالحة
    اللهم ارزقني الزوجة الصالحة
    اللهم اجعلها عونا لي في ديني ودنياي
    اللهم وفقني اليها وبها
    اللهم ان كان فى هذا خير لي فوفقني ويسره لي
    واهدني وارزقني من حيث لا احتسب
    اللهم وان كان هذا شر لي فاصرفه عني واصرفني عنه
    واقضي لي الخير حيث كان ثم ارضني به
    اللهم ان كتبت لي هذا فبارك لي فيها
    وبارك لها في
    و انعم علينا بفضلك وكرمك بالخير والبركة
    اللهم انك تعلم ان لي من هذا ريبا
    فانعم علي بالهداية والسكينة ان كان خيرا
    وانعم علي بعدا وصرفا واعراضا عن هذا
    ان علمت بعلمك الواسع ان فى هذا شرا
    اللهم و ان لك الحمد اولا و اخرا وظاهرا وباطنا
    فالحمد لك على ما اعطيت وانعمت به وهو الخير
    والحمد لك على ما منعت وصرف وهو الخير
    `,
    status: 'Harm',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: null,
    header: `دعاء`,
    description: `اللهم اني اسالك العفو والعافية
    اللهم عافني فى بدني
    اللهم انعم علي بما متعتني فيه من صحتي
    اللهم لاتحرمني منها
    اللهم لا تقضي على بتحول عافيتك
    اللهم انا اسالك ان تنعم علي
    بصحة حتي الممات
    وجسد معافي حتي ينفذ قدرك
    الحمد لك اولا و اخرا وظاهرا وباطنا
    على ماانعمت به علينا حتي الان
    و على ماستنعم به علينا حتي الممات
    وعلى ماستنعم به علينا حين نلقاك
    والحمد لك دائما وابدا
    وان لم نبلغ من حمدك اقل القليل من قدرك العالي الجليل العظيم
    فانك يارب تعلم
    انا لك حامدون
    ولنعمتك شاكرون
    وبسترك و بما انعمت علينا من عافية ورزق ونعمة مقرون ومعترفون
    مابنا من خير فمنك وحدك
    وما بنا من شر بما كسبت ايدينا
    اللهم انا قد اقررنا و اعترفنا وشهدنا واشهدناك على هذا
    لا تقض لنا بفضلك الا الخير
    ولا تكتب لنا الا التوفيق والعفو والعافية
    وارزقنا من رحمتك ومغفرتك ونعمتك دائما وابدا
    `,
    status: 'Harm',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: null,
    header: `دعاء`,
    description: `اللهم وان قد اكثرت عليك بالسؤال
    و اكثرت بالطلب
    واردت الزيادة فيما انت منعم علينا به حقا
    فمن سواك اساله
    ومن سواك يستجيب
    ومن سواك يقدر
    ومن سواك يجود ويعطي
    ومن سواك كريم
    اللهم ماسالتك نكرانا لنعمتك
    حاشا فان نعمتك قد افاضت علي
    و اعطيتني مالم اكن فى يوم اتخيل ان اكون فيه
    ولكن النفس تريد و تريد من رزقك الحلال الطيب
    برحمتك وكرمك وجودك وفضلك الواسع
    فلا سؤال الا لك
    ولا طلب الا منك
    ولا معونة فى الدنيا ولا الاخرة الا من عندك
    اللهم انا حامدين شاكرين راضيين مقريين بما اعطيت
    و حامدين شاكرين راضيين مقرين بما منعت
    فانت الذي عطاؤك الخير وانت الذي منعك الخير
    تباركت ربنا وتعاليت
    `,
    status: 'Harm',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: null,
    header: `دعاء`,
    description: `اللهم اغفر لامي
    اللهم متعها بصحتها وعافيتها
    اللهم انعم عليها برحمتك وجنتك
    اللهم عوضها عن كل شئ
    اللهم اجزها عنا خير الجزاء
    اللهم سلم بدنها
    اللهم رد عليها عافيتها
    اللهم اغفر لها
    اللهم انك تعلم انها قد مرت بالكثير
    فارضها واكرمها وانت كرمك الواسع يارب العالمين
    اجزها عنا خير الجزاء
    اللهم اهد قلبها و انزل عليها السكينة
    اللهم ادخل السرور عليها
    اللهم اتها ماتريد
    و ارضها و اكتب لها زيارة بيتك الحرام
    عاجل غير اجل يارب العالمين
    `,
    status: 'Harm',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: null,
    header: `دعاء`,
    description: `
    اللهم ارزقني علما انتفع به في ديني ودنياي
    اللهمّ علّمنا ما جهلنا، وذكّرنا ما نُسينا
    وافتح علينا من بركات السماء والأرض
    إنك أنت السميع العليم
    اللهمّ انفعنا بما علّمتنا، وعلّمنا ما ينفعنا
    وزدنا علمًا وبارك لنا فيه
    اللهم افتح لنا أبواب حكمتك
    واكتب لنا من رحمتك
    وامنن علينا بالحفظ والفهم
    سُبحانك لا عِلمَ لنا إلا ما علمتنا إنك أنت العليم الحكيم
    اللهم ارزقني العلم النافع
    اللهم انعم علي بالحكمة
    اللهم زدني علما
    اللهم إفتح علي فتوح العارفين
    وعلمني علوم العالمين
    وذكرني ما نسيت يا ذا الجلال والإكرام
    اللهم ألهمني علماً أعرف به أوامرك
    وأجتنب به نواهيك
    وارزقني بلاغة فهم النبيين وفصاحة حفظ المرسلين
    وسرعة إلهام الملائكة المقربين
    وعلمني أسرار حكمتك يا حي يا قيوم
    `,
    status: 'Harm',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    stepType: 'Private',
    header: 'دعاء',
    content: `عن عبد الله بن جعفر رضي الله عنه قال:
    لما تُوفِّيَ أبو طالب خرج النبي صلى الله عليه وسلم إلى الطائف ماشياً على قدميه،
    يدعوهم إلى الإِسلام فلم يجيبوه،
    فانصرف فأتى ظل شجرة فصلى ركعتين ثم قال:
    اللهم إليك أشكو ضعف قوتي، وقلة حيلتي، وهواني على الناس ،
    يا أرحم الراحمين، أنت رب المستضعفين وأنت ربي إلى من تكِلني ؟
    إلى بعيدٍ يَتَجَهَّمُنِي ؟
    أمْ إلى عدو ملَّكْتَه أمْري؟
    إن لم يكن بك عليَّ غضب فلا أبالي، ولكن عافيتك أوسع لي،
    أعوذ بنور وجهك الذي أشرقت له الظلمات،
    وصلح عليه أمر الدنيا والآخرة،
    أن ينزل بي غضبك، أو يحل بي سخطك، لك العُتبى (الاسترضاء) حتى ترضى ،
    ولا قوة إلا بالله
    رواه الطبراني في الكبير، والخطيب البغدادي في "الجامع لأخلاق الراوي"، وذكره ابن هشام وغيره في السيرة النبوية،وقال الهيثمي في "مجمع الزوائد" "رواه الطبراني، وفيه ابن إسحاق وهو مدلس ثقة، وبقية رجاله ثقات".`,
  },
  {
    place: null,
    stepType: 'Private',
    header: `دعاء`,
    content: `اللهم اني قد جئتك عاص فاغفرلي
    اللهم اني جئتك نادم فتب علي
    اللهم جئتك مذنب فاهدني وارحمن
    اللهم رضاك والجنة
    اللهم اني اسالك ان ترضي
    اللهم اني اسالك ان ترضي
    اللهم اغفر لي
    اللهم تب علي
    اللهم اهدني
    اللهم قربني اليك
    اللهم اهدني اليك
    اللهم انك تعلم ان غاية مطلبي رضاك
    فلا تردني
    انت ارحم الراحمين
    انت ربي وانا عبدك
    شهدت لك بالوحدانية
    وشهدت لرسولك بالنبوة
    وقبلت بالاسلام دينا
    فان كنت قد عصيتك
    فضعف مني و تقصير
    وانت الغفور الرحيم الحليم الكريم
    اغفرلي مع من غفرت لهم
    وتب علي مع من تبت عليهم
    اللهم ان رددتني فما غايتي فى المحي والممات
    من سواك لي
    رب اشهدتنا انك عند ظن عبادك بك
    وظني فيك يارب انت التواب الجواد الكريم
    ظن فيك يارب انك اللطيف الغفور الرحمن الرحيم
    تقبلني وتب علي
    `,
  },
  {
    place: null,
    stepType: 'Private',
    header: `دعاء`,
    content: `اللهم اني اسالك من فضلك الواسع الكريم
    وانت الكريم
    اللهم اني اسالك رزقا حلالا طيبا كثيرا كثيرا مباركا فيه
    اللهم اني اسالك ان تغنين بحلالك عن حرامك
    اللهم بارك لي فى ما رزقتني
    اللهم افتح علي من خزائن رحمتك
    اللهم ارزقني من حيث لا احتسب
    اللهم ارزقني بجودك وكرمك
    وانت الجواد الكريم
    اللهم ارزقني و ارزقني و ارزقني وبارك لي في رزقي
    `,
  },
  {
    place: null,
    stepType: 'Private',
    header: `دعاء`,
    content: `اللهم ارزقني الزوجة الصالحة
    اللهم ارزقني الزوجة الصالحة
    اللهم ارزقني الزوجة الصالحة
    اللهم اجعلها عونا لي في ديني ودنياي
    اللهم وفقني اليها وبها
    اللهم ان كان فى هذا خير لي فوفقني ويسره لي
    واهدني وارزقني من حيث لا احتسب
    اللهم وان كان هذا شر لي فاصرفه عني واصرفني عنه
    واقضي لي الخير حيث كان ثم ارضني به
    اللهم ان كتبت لي هذا فبارك لي فيها
    وبارك لها في
    و انعم علينا بفضلك وكرمك بالخير والبركة
    اللهم انك تعلم ان لي من هذا ريبا
    فانعم علي بالهداية والسكينة ان كان خيرا
    وانعم علي بعدا وصرفا واعراضا عن هذا
    ان علمت بعلمك الواسع ان فى هذا شرا
    اللهم و ان لك الحمد اولا و اخرا وظاهرا وباطنا
    فالحمد لك على ما اعطيت وانعمت به وهو الخير
    والحمد لك على ما منعت وصرف وهو الخير
    `,
  },
  {
    place: null,
    stepType: 'Private',
    header: `دعاء`,
    content: `اللهم اني اسالك العفو والعافية
    اللهم عافني فى بدني
    اللهم انعم علي بما متعتني فيه من صحتي
    اللهم لاتحرمني منها
    اللهم لا تقضي على بتحول عافيتك
    اللهم انا اسالك ان تنعم علي
    بصحة حتي الممات
    وجسد معافي حتي ينفذ قدرك
    الحمد لك اولا و اخرا وظاهرا وباطنا
    على ماانعمت به علينا حتي الان
    و على ماستنعم به علينا حتي الممات
    وعلى ماستنعم به علينا حين نلقاك
    والحمد لك دائما وابدا
    وان لم نبلغ من حمدك اقل القليل من قدرك العالي الجليل العظيم
    فانك يارب تعلم
    انا لك حامدون
    ولنعمتك شاكرون
    وبسترك و بما انعمت علينا من عافية ورزق ونعمة مقرون ومعترفون
    مابنا من خير فمنك وحدك
    وما بنا من شر بما كسبت ايدينا
    اللهم انا قد اقررنا و اعترفنا وشهدنا واشهدناك على هذا
    لا تقض لنا بفضلك الا الخير
    ولا تكتب لنا الا التوفيق والعفو والعافية
    وارزقنا من رحمتك ومغفرتك ونعمتك دائما وابدا
    `,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: `دعاء`,
    content: `اللهم وان قد اكثرت عليك بالسؤال
    و اكثرت بالطلب
    واردت الزيادة فيما انت منعم علينا به حقا
    فمن سواك اساله
    ومن سواك يستجيب
    ومن سواك يقدر
    ومن سواك يجود ويعطي
    ومن سواك كريم
    اللهم ماسالتك نكرانا لنعمتك
    حاشا فان نعمتك قد افاضت علي
    و اعطيتني مالم اكن فى يوم اتخيل ان اكون فيه
    ولكن النفس تريد و تريد من رزقك الحلال الطيب
    برحمتك وكرمك وجودك وفضلك الواسع
    فلا سؤال الا لك
    ولا طلب الا منك
    ولا معونة فى الدنيا ولا الاخرة الا من عندك
    اللهم انا حامدين شاكرين راضيين مقريين بما اعطيت
    و حامدين شاكرين راضيين مقرين بما منعت
    فانت الذي عطاؤك الخير وانت الذي منعك الخير
    تباركت ربنا وتعاليت
    `,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: `دعاء`,
    content: `اللهم اغفر لامي
    اللهم متعها بصحتها وعافيتها
    اللهم انعم عليها برحمتك وجنتك
    اللهم عوضها عن كل شئ
    اللهم اجزها عنا خير الجزاء
    اللهم سلم بدنها
    اللهم رد عليها عافيتها
    اللهم اغفر لها
    اللهم انك تعلم انها قد مرت بالكثير
    فارضها واكرمها وانت كرمك الواسع يارب العالمين
    اجزها عنا خير الجزاء
    اللهم اهد قلبها و انزل عليها السكينة
    اللهم ادخل السرور عليها
    اللهم اتها ماتريد
    و ارضها و اكتب لها زيارة بيتك الحرام
    عاجل غير اجل يارب العالمين
    `,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: `دعاء`,
    content: `
    اللهم ارزقني علما انتفع به في ديني ودنياي
    اللهمّ علّمنا ما جهلنا، وذكّرنا ما نُسينا
    وافتح علينا من بركات السماء والأرض
    إنك أنت السميع العليم
    اللهمّ انفعنا بما علّمتنا، وعلّمنا ما ينفعنا
    وزدنا علمًا وبارك لنا فيه
    اللهم افتح لنا أبواب حكمتك
    واكتب لنا من رحمتك
    وامنن علينا بالحفظ والفهم
    سُبحانك لا عِلمَ لنا إلا ما علمتنا إنك أنت العليم الحكيم
    اللهم ارزقني العلم النافع
    اللهم انعم علي بالحكمة
    اللهم زدني علما
    اللهم إفتح علي فتوح العارفين
    وعلمني علوم العالمين
    وذكرني ما نسيت يا ذا الجلال والإكرام
    اللهم ألهمني علماً أعرف به أوامرك
    وأجتنب به نواهيك
    وارزقني بلاغة فهم النبيين وفصاحة حفظ المرسلين
    وسرعة إلهام الملائكة المقربين
    وعلمني أسرار حكمتك يا حي يا قيوم
    `,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'الدعاء للاهل والاقارب',
    content: `امي
    هاله
    جدتي
    اسماء الشامي
    وليد عاطف واهله
    نبيل واهله
    نائل
    احمد عويد
    مصطفي شامة واهله وابنه
    ابي وجدي
    اخوالي
    خالد ابو العز
    هشام ناجي
    محمد صبري
    سلمي و تقي
    مي فايز
    محمد رزق ومحمد اشرف
    ومحمد عاطف ومحمد علي
    فتحي ومحمد مجدي ومحمد مصطفي
    محمود اسامة
    محمود اشرف وممدوح محي
    نسمة ورحاب ومليكة
    شيماء و مروة و بسنت وذويهم
    شروق ونرمين وسارة
    مهند واحمد الصعيدي وعمار
    احمد حسن واحمد نجيب وااحمد عبدالله
    الحسن وهاني وحسين
    نورهان خالد
    عبد الرحمن خالد
    زملاء شركة دي جي
    زملاء شركة جي اي تي
    عامة المسلمين`,
    isAdminOnly: true,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `اللهم صل على محمد وعلى آل محمد كما
    صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد
    اللهم بارك على محمد وعلى آل محمد كما
    باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: 'اللهم انا نسألك رضاك والجنة ونعوذ بك من سخطك والنار',
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة
    اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي
    اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي
    وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: 'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.',
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: 'اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.',
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ
    مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ
    وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ
    وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي
    وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ ، الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ ،
    وَإِذَا سُئِلْتَ بِهِ أَعْطَـيْتَ
    أَسْأَلُكَ بِأَنِّي أَشُهَدُ أَنَّكَ أَنْتَ اللهُ لا إِلَهَ إِلاَّ أَنْتَ ،
    الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ، وَلَمْ يَولَدْ ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ
    أَنْ تَغْفِرَ لِي ذُنُوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `اللَّهُم اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي ، وَإِسْرَافِي فِي أَمْرِي ،
    وَمَا أَنْتَ أَعْـلَمُ بِهِ مِنّـِي
    اللَّهُمَّ اغْفِرْ لِي هَزْلِي وَجِدِّي ، وَخَطَئِي وَعَمْدِي ، وَكُلُّ ذَلِكَ عِنْدِي`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content:
      'اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَااسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ.',
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content:
      'اللَّهُمَّ يَا مَنْ لا تَضُرُّهُ الذُّنُوبُ ، وَلا تُنْقِصُهُ المَغْفِرَةُ ، اغْفِرْ لَنَا مَا لا يَضُرُّكَ ، وَهَبْ لَنَا مَالا يُنْقِصُكَ.',
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: 'اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلّهُ ، دِقَّهُ وَجُلَّهُ ، وَأَوَّلَهُ وَآخِرَهَ ، وَعَلاَنِيَتَهَ وَسِرَّهُ.',
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: 'أَرِنَا الحَقَّ حقَّاً وَارْزُقْنَا اتِّبَاعَهُ، وَأَرِنَا البَاطِلَ بَاطِلاً وَارْزُقْنَا اجْتِنَابَهُ.',
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: 'آتِ نَفْسِي تَقْوَاهَا ، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلاهَا.',
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ ، نَاصِيَتِي بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤكَ
    أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيتَ بِهِ نَفْسَكَ ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ
    أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيبِ عِنْدَك
    أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي ، وَنُورَ صَدْرِي ، وَجَلاءَ حَزَنِي ، وَذَهَابَ هَمِّي`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: 'لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ". [الأنبياء 87].',
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `عَنْ عَائِشَةَ رضي الله عنها
    أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَلَّمَهَا هَذَا الدُّعَاءَ
    اللهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَم
    وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ، عَاجِلِهِ وَآَجِلِهِ مَا عَلِمْتُ مِنْهُ، وَمَا لَمْ أَعْلَمْ
    اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ
    بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ
    اللهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ تَقْضِيهِ لِي خَيْرًا`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `اللهم انت ربي لا اله الا انت
    خلقتني وانا عبدك
    وانا على عهدك ووعدك ما استطعت
    اعوذ بك من شر ما صنعت
    ابوء لك بنعمتك علي
    وابوء بذنبي
    فاغفر لي فانه لا يغفر الذنوب الا انت`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `لا اله الا الله الحليم الكريم
     سبحان رب العرش العظيم الحمد لله رب العالمين
     اللهم اني اسالك موجبات رحمتك
     وعزائم مغفرتك والغنيمه من كل بر والسلامه من كل اثم
     اللهم لا تدع لي ذنبا الا غفرته ولا هما الا فرجته
     ولا حاجه هي لك رضا الا قضيتها يا رب العالمين يا ارحم الراحمين`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `اللهم لك الحمد انت نور السماوات والارض ومن فيهن
    ولك الحمد انت قيوم السماوات والارض ومن فيهن
    ولك الحمد انت الحق و وعدك حق وقولك حق والجنه حق والنار حق
    والساعه حق والنبيون حق ومحمد حق
    اللهم لك اسلمت و عليك توكلت
    وبك امنت واليك انبت
    فاغفر لي ما قدمت وما اخرت
    وما اسررت وما اعلنت
    انت المقدم وانت المؤخر لا اله الا انت`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: 'اللهم لك الحمد كله واليك يرجع الامر كله علانيته وسره فانت حق من يعبد وانت حق من يحمد وانت على كل شيء قدير',
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `اللهم لك اسلمت وعليك توكلت
    وبك امنت واليك انبت وبك خاصمت واليك حاكمت
    فاغفر لي ما قدمت وما اخرت وما اسررت وما اعلنت`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `الحمد لله الذي من علينا بالاسلام الحمد لله رب العالمين
    الحمد لله الذي له ما في السماوات وما في الارض
    وله الحمد في الدنيا وفي الاخره وهو الحكيم الخبير`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `اللهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ
    وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ، عَاجِلِهِ وَآَجِلِهِ مَا عَلِمْتُ مِنْهُ، وَمَا لَمْ أَعْلَمْ
    اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ
    وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ
    اللهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ تَقْضِيهِ لِي خَيْرًا`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: 'لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ. [الأنبياء null 87].',
  },
  {
    place: null,
    stepType: 'Zikr',
    header: `الشهادة`,
    content: `أشهد أن لا إله إلا الله وحده لا شريك له
    ولا ولد له ، ولا والد له ، ولا صاحبة له ، ولا نظير له
    ولا وزير ولا مشير له ، ولا عديد ولا نديد ولا قسيم
    وأشهد أنَّ محمداً عبده ورسوله ، وحبيبه وخليله
    المصطفى من خُلاصة العرب العَرْباء من الصميم ، خاتم الأنبياء
    وصاحب الحوض الأكبر الرَّواء
    صاحب الشفاعة العظمى يوم القيامة
    حامل اللواء الذي يبعثه الله تعالى المقام المحمود الذي يرغب إليه فيه الخلقُ كلُّهم
    حتى الخليل إبراهيم وعلى سائر إخوانه من النبيين والمرسلين
    وسلَّم وشرَّف وكرَّم أزكى صلاةٍ وتسليم
    وأعلى تشريف وتكريم
    ورضي الله عن جميع أصحابه الغرّ الكرام
    السادة النجباء الأعلام
    خلاصة العالم بعد الأنبياء
    ما اختلط الظلام بالضياء
    وما أعلن الداعي بالنداء
    وما نسخ النهار ظلام الليل البهيم`,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: `الدعاء الجامع`,
    content: `اللهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ
    وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ، عَاجِلِهِ وَآَجِلِهِ مَا عَلِمْتُ مِنْهُ، وَمَا لَمْ أَعْلَمْ
    اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ
    وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ
    اللهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ تَقْضِيهِ لِي خَيْرًا`,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: `ذكر`,
    content: `اللهم اني اشهدك اني اشهد انه لا اله الا انت
    انت الاول والاخر والظاهر والباطن
    انت العظيم القوي القدير
    لا يعجزك شي
    لا اله الا انت رب العالمين
    `,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: `دعاء`,
    content: `يا رَبِّ إِن عَظُمَت ذُنوبي كَثرَةً
    فَلَقَد عَلِمتُ بِأَنَّ عَفوَكَ أَعظَمُ
    إِن كانَ لا يَرجوكَ إِلّا مُحسِنٌ
    فَبِمَن يَلوذُ وَيَستَجيرُ المُجرِمُ
    أَدعوكَ رَبِّ كَما أَمَرتَ تَضَرُّعاً
    فَإِذا رَدَدتَ يَدي فَمَن ذا يَرحَمُ
    ما لي إِلَيكَ وَسيلَةٌ إِلا الرَجا
    وَجَميلُ عَفوِكَ ثُمَّ أَنّي مُسلِمُ
    `,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: 'ذكر',
    content: `عَنْ أُبَيِّ بْنِ كَعْبٍ رضي الله عنه قَالَ :
    قُلْتُ : يَا رَسُولَ اللَّهِ إِنِّي أُكْثِرُ الصَّلَاةَ عَلَيْكَ فَكَمْ أَجْعَلُ لَكَ مِنْ صَلَاتِي ؟
    فَقَالَ : مَا شِئْتَ . قَالَ قُلْتُ الرُبُعَ ؟
    قَالَ : مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ . قُلْتُ النِّصْفَ ؟
    قَالَ : مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ . قَالَ قُلْتُ فَالثُّلُثَيْنِ ؟
    قَالَ : مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ . قُلْتُ أَجْعَلُ لَكَ صَلَاتِي كُلَّهَا ؟
    قَالَ : إِذًا تُكْفَى هَمَّكَ وَيُغْفَرُ لَكَ ذَنْبُكَ`,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: 'ذكر',
    content:
      'آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ (285) لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ (286)',
  },
  {
    place: null,
    stepType: 'Zikr',
    header: 'ايه الكرسي',
    content:
      'اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى null البقرة 255].  (من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.)',
  },
  {
    place: null,
    stepType: 'Zikr',
    header: 'المعوذتان والفاتحة',
    content:
      'قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.  (من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).)',
  },
  {
    place: null,
    stepType: 'Zikr',
    header: 'اذكار الصباح',
    content: `أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله
  لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد وهُوَ على كلّ شَيءٍ قدير
  رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه
  وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه
  رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر
  رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر`,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: 'اذكار الصباح',
    content: `اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك
  وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت
  أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت
  أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي
  فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ`,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: 'اذكار الصباح',
    content: `رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً
  (من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.)`,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: 'اذكار الصباح',
    content: `اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك
  وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك
  أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك
  وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك
  (من قالها أعتقه الله من النار.)`,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: 'اذكار الصباح',
    content: `حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم
  (من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.)`,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: 'اذكار الصباح',
    content: `اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك
  فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك
  فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر
  (من قالها حين يصبح أدى شكر يومه.)`,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: 'ذكر',
    content: `لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ
    عدد 100 مرة (كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان)`,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: 'ذكر',
    content: `سُبْحـانَ اللهِ وَبِحَمْـدِهِ
  (حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ.
  لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ)`,
  },
  {
    place: null,
    stepType: 'Zikr',
    header: 'ذكر',
    content: `أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ
    (مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى)`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: `اللهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِه مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ
    وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآَجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ
    اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ
    وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ
    اللهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ تَقْضِيهِ لِي خَيْرًا`,
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'دعاء',
    content: 'لا ننسي الدعاء للاهل وذوي القربي والاصحاب بصلاح الحال والتوفيق والهداية وطلب الشفاء للمريض و طلب الرحمة للمتوفي',
  },
  {
    place: null,
    stepType: 'Doaa',
    header: 'الدعاء لاهل فلسطين',
    content: `الدعاء للاهل والاخوة فى فلسطين`,
  },
  {
    place: 'elMasgedElNabawy',
    title: null,
    header: 'دعاء',
    description: `اللهم ان نشهدك انا نحب رسولك وصحابة رسولك
    اللهم اجزهم عنا خير الجزاء
    واكتب لنا شفاعة رسولك الكريم
    واحشرنا مع رسولك الكريم و الصحابة الاخيار الاطهار يوم الدين`,
    status: 'Madina',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: null,
    header: 'ذكر',
    description: `اللهم صلي على سيدنا محمد وعلى ال سيدنا محمد
    كما صليت على سيدنا ابراهيم وعلى ال سيدنا ابراهيم
    فى العالمين انك حميد مجيد`,
    status: 'Madina',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: null,
    header: 'مقابر الشهداء',
    description: `السلام عليكم أهل الديار من المؤمنين والمسلمين
    السلام عليكم صحابة رسول الله وامهات المؤمنين والمؤمنات
    يرحم الله المستقدمين منا ومنكم والمستأخرين
    وإنا إن شاء الله بكم لاحقون
    نسأل الله لنا ولكم العافية
    اللهم لا تحرمنا أجرهم ولا تفتنا بعدهم واغفر لنا ولهم`,
    status: 'Madina',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: null,
    header: `دعاء`,
    description: `
    يا رَبِّ إِن عَظُمَت ذُنوبي كَثرَةً
    فَلَقَد عَلِمتُ بِأَنَّ عَفوَكَ أَعظَمُ
    إِن كانَ لا يَرجوكَ إِلّا مُحسِنٌ
    فَبِمَن يَلوذُ وَيَستَجيرُ المُجرِمُ
    أَدعوكَ رَبِّ كَما أَمَرتَ تَضَرُّعاً
    فَإِذا رَدَدتَ يَدي فَمَن ذا يَرحَمُ
    ما لي إِلَيكَ وَسيلَةٌ إِلا الرَجا
    وَجَميلُ عَفوِكَ ثُمَّ أَنّي مُسلِمُ
    `,
    status: 'Harm',
    image: null,
    link: null,
    location: null,
  },

  {
    place: 'elMasgedElNabawy',
    title: 'main',
    header: 'دخول الروضة',
    description:
      'ثم يصلي ركعتين تحية المسجد، والأفضل أن تكونا في الروضة الشريفة والأولى أن تكون صلاته في الروضة وهي ما بين منبر النبي صلى الله عليه وسلم وحجرته التي فيها قبره لأن ما بينهما روضة من رياض الجنة',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'hadith',
    header: 'فضل الروضة',
    description: 'قوله صلى الله عليه وسلم كما في الصحيحين: (ما بين بيتي ومنبري روضة من رياض الجنة، ومنبري على حوضي)',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: 'hotelMadina',
    title: 'zikr',
    header: 'الذكر عند الاحرام',
    description: 'سُبْحَانَ اللهِ وَالحَمْدُ للهِ وَالله أَكْبَرُ',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'hotelMadina',
    title: 'main',
    header: null,
    description: `لا يقص الشعر و لا التطيب ولا قص الاظافر ولا تغطي الراس بالاحرام
  لا يجوز قطع ورقة شجرة او نبته ولا يجوز ترويع الطير او اصطيادها
  اذا وجدت شي بالارض فى الحرم اتركه كما هو`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ. [الأنبياء null 87].',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِه مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ
  وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآَجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ
  اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ
  وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ
  اللهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
  وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
  وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ تَقْضِيهِ لِي خَيْرًا`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'main',
    header: 'مناسك',
    description: `ثم قراءة الاية
  بسم الله الرحمن الرحيم
  إِنَّ الصَّفَا وَالْمَرْوَةَ مِن شَعَائِرِ اللَّهِ
  فَمَنْ حَجَّ الْبَيْتَ أَوِ اعْتَمَرَ فَلَا جُنَاحَ عَلَيْهِ أَن يَطَّوَّفَ بِهِمَا
  وَمَن تَطَوَّعَ خَيْرًا فَإِنَّ اللَّهَ شَاكِرٌ عَلِيمٌ (158)
  [البقرة]`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: null,
    title: 'main',
    header: 'مناسك',
    description: `بسم الله
  الله اكبر الله اكبر الله اكبر
  لا اله الا الله وحده لا شريك له
  له الملك وله الحمد وهو على كل شئ قدير
  لا اله الا الله انجز وعده ونصر عبده وهزم الاحزاب وحده`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: 'doaa',
    header: 'دعاء السفر',
    description: `الله اكبر الله اكبر الله اكبر
    سبحان الذي سخر لنا هذا وما كنا له مقرنين
    وانا الى ربنا لمنقلبون
    اللهم انا نسالك في سفرنا هذا البر والتقوى ومن العمل ما ترضى
    اللهم هون علينا سفرنا هذا واطوي عنا بعده
    اللهم انت الصاحب السفر والخليفه في الاهل اللهم
    اني اعوذ بك من وعثاء السفر وكابه المنظر
    وسوء المنقلب في المال والاهل`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElHaram',
    title: 'doaa',
    header: 'عند الدخول للحرم نقول',
    description: `بسم الله والصلاة والسلام على رسول الله،
  أعوذ بالله العظيم وبوجهه الكريم
  وسلطانه القديم من الشيطان الرجيم
  اللهم افتح لي أبواب رحمتك`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللهم صل على محمد وعلى آل محمد كما
    صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد
    اللهم بارك على محمد وعلى آل محمد كما
    باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'اللهم انا نسألك رضاك والجنة ونعوذ بك من سخطك والنار',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة
  اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي
  اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي
  وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ
  مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ
  وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ
  وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي
  وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'ذكر',
    description: `لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ
    عدد 100 مرة (كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'ذكر',
    description: `سُبْحـانَ اللهِ وَبِحَمْـدِهِ
  (حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ.
  لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'ذكر',
    description: `أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ
    (مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: 'elMasgedElHaram',
    title: 'doaa',
    header: 'الدعاء عند رؤية الكعبة',
    description: 'اللهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، فَحَيِّنَا رَبَّنَا بِالسَّلَامِ',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ ، الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ ،
    وَإِذَا سُئِلْتَ بِهِ أَعْطَـيْتَ
    أَسْأَلُكَ بِأَنِّي أَشُهَدُ أَنَّكَ أَنْتَ اللهُ لا إِلَهَ إِلاَّ أَنْتَ ،
    الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ، وَلَمْ يَولَدْ ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ
    أَنْ تَغْفِرَ لِي ذُنُوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللَّهُم اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي ، وَإِسْرَافِي فِي أَمْرِي ،
  وَمَا أَنْتَ أَعْـلَمُ بِهِ مِنّـِي
  اللَّهُمَّ اغْفِرْ لِي هَزْلِي وَجِدِّي ، وَخَطَئِي وَعَمْدِي ، وَكُلُّ ذَلِكَ عِنْدِي`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description:
      'اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَااسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description:
      'اللَّهُمَّ يَا مَنْ لا تَضُرُّهُ الذُّنُوبُ ، وَلا تُنْقِصُهُ المَغْفِرَةُ ، اغْفِرْ لَنَا مَا لا يَضُرُّكَ ، وَهَبْ لَنَا مَالا يُنْقِصُكَ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلّهُ ، دِقَّهُ وَجُلَّهُ ، وَأَوَّلَهُ وَآخِرَهَ ، وَعَلاَنِيَتَهَ وَسِرَّهُ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'أَرِنَا الحَقَّ حقَّاً وَارْزُقْنَا اتِّبَاعَهُ، وَأَرِنَا البَاطِلَ بَاطِلاً وَارْزُقْنَا اجْتِنَابَهُ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'آتِ نَفْسِي تَقْوَاهَا ، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلاهَا.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ ، نَاصِيَتِي بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤكَ
  أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيتَ بِهِ نَفْسَكَ ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ
  أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيبِ عِنْدَك
  أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي ، وَنُورَ صَدْرِي ، وَجَلاءَ حَزَنِي ، وَذَهَابَ هَمِّي`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ". [الأنبياء 87].',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `عَنْ عَائِشَةَ رضي الله عنها
  أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَلَّمَهَا هَذَا الدُّعَاءَ
  اللهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَم
  وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ، عَاجِلِهِ وَآَجِلِهِ مَا عَلِمْتُ مِنْهُ، وَمَا لَمْ أَعْلَمْ
  اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ
  بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ
  اللهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
  وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
  وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ تَقْضِيهِ لِي خَيْرًا`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'pray',
    header: 'صلاة العشاء',
    description: null,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'hotelMadina',
    title: 'moves',
    header: 'التوجه للفندق وترك الامتعة',
    description: 'تجديد النية لزيارة مسجد رسول الله',
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/RaTsD5MgpJppyR4ZA',
  },
  {
    place: 'elMasgedElNabawy',
    title: 'moves',
    header: 'التوجه للمسجد النبوي',
    description: 'فيديو توضيحي للمسجد النبوي',
    status: 'active',
    image: 'assets/images/omra9.png',
    link: 'https://www.youtube.com/watch?v=cuWYQraqK8o&ab_channel=الشيخفراسإدريسFirasEdris',
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'moves',
    header: 'التوجه للمسجد النبوي',
    description: 'فيديو توضيحي للمسجد النبوي',
    status: 'active',
    image: null,
    link: 'https://www.youtube.com/watch?v=auFFTatAB9A&ab_channel=دليلزائريالحرمين',
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'moves',
    header: 'البقيع',
    description: `السلام عليكم أهل الديار من المؤمنين والمسلمين
    وإنا إن شاء الله بكم لاحقون
    يرحم الله المستقدمين منا ومنكم والمستأخرين
    نسأل الله لنا ولكم العافية اللهم
    لا تحرمنا أجرهم ولا تفتنا بعدهم واغفر لنا ولهم`,
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/V5uUtsURXcLVLN8eA',
  },
  {
    place: 'elMasgedElNabawy',
    title: 'moves',
    header: 'التوجه للمسجد النبوي',
    description: `السلام عليكم أهل الديار من المؤمنين والمسلمين
    وإنا إن شاء الله بكم لاحقون
    يرحم الله المستقدمين منا ومنكم والمستأخرين
    نسأل الله لنا ولكم العافية اللهم
    لا تحرمنا أجرهم ولا تفتنا بعدهم واغفر لنا ولهم`,
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/bKGXdCSb8TXaikdY9',
  },
  {
    place: 'elMasgedElNabawy',
    title: 'doaa',
    header: 'دعاء دخول المسجد',
    description: `بسم الله والصلاة والسلام على رسول الله،
    أعوذ بالله العظيم وبوجهه الكريم
    وسلطانه القديم من الشيطان الرجيم
    اللهم افتح لي أبواب رحمتك`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'pray',
    header: 'صلاة ركعتين تحية للمسجد و صلاة الظهر والسنن',
    description: null,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'ohod',
    title: 'moves',
    header: 'التوجه لمنطقة شهداء احد',
    description: null,
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/77eKNKxnoLzuU5yM7',
  },
  {
    place: 'ohod',
    title: 'doaa',
    header: 'دعاء دخول مقابر احد',
    description: `السلام عليكم أهل الديار من المؤمنين والمسلمين
    وإنا إن شاء الله بكم لاحقون
    يرحم الله المستقدمين منا ومنكم والمستأخرين
    نسأل الله لنا ولكم العافية اللهم
    لا تحرمنا أجرهم ولا تفتنا بعدهم واغفر لنا ولهم`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'pray',
    header: 'التوجه للمسجد النبوي وصلا ةالعصر',
    description: null,
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/FWTUbW8T18JUW86y8',
  },
  {
    place: 'elMasgedElNabawy',
    title: 'doaa',
    header: 'دعاء دخول المسجد',
    description: `بسم الله والصلاة والسلام على رسول الله،
    أعوذ بالله العظيم وبوجهه الكريم
    وسلطانه القديم من الشيطان الرجيم
    اللهم افتح لي أبواب رحمتك`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'main',
    header: 'دخول الروضة',
    description: 'دخول الروضة من باب 39 ويسمي باب النساء',
    status: 'active',
    image: 'assets/images/omra10.png',
    link: null,
    location: 'https://goo.gl/maps/De6AxK49C243ZihD9',
  },

  {
    place: 'elMasgedElNabawy',
    title: 'main',
    header: 'دخول الروضة',
    description: 'الوصول للقبر من جانب المبنر',
    status: 'active',
    image: 'assets/images/omra11.png',
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'main',
    header: 'دخول الروضة',
    description:
      'ثم يصلي ركعتين تحية المسجد، والأفضل أن تكونا في الروضة الشريفة والأولى أن تكون صلاته في الروضة وهي ما بين منبر النبي صلى الله عليه وسلم وحجرته التي فيها قبره لأن ما بينهما روضة من رياض الجنة',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'hadith',
    header: 'فضل الروضة',
    description: 'قوله صلى الله عليه وسلم كما في الصحيحين: (ما بين بيتي ومنبري روضة من رياض الجنة، ومنبري على حوضي)',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'main',
    header: 'الخروج من الروضة',
    description: 'الخروج من باب البقيع',
    status: 'active',
    image: 'assets/images/omra12.png',
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'main',
    header: 'زيارة قبر النبي',
    description: `الوقوف أمامه بأدب ووقار وقول :
      السلام عليك أيها النبي ورحمة الله السلام عليك يارسول الله
      السلام عليك ياحبيب الله وبركاته اللهم صل على محمد وعلى آل محمد
      كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد
      اللهم بارك على محمد وعلى آل محمد
      كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد
      أشهد أنك رسول الله حقا أشهد انك قد بلغت الرسالة
      وأديت الأمانة ونصحت الأمة وجاهدت في الله حق جهاده
      فجزاك الله عنا وعن أمتك أفضل ما جزى نبيا عن أمته`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'main',
    header: 'قبر ابو بكر الصديق',
    description: `السلام عليك يا أبا بكر
    السلام عليك ياصاحب رسول الله
    السلام عليك ايها الصديق
    السلام عليك يا خليفة رسول الله
    جزاك الله عنا و عن أمة رسول الله صلى الله عليه وسلم خير الجزاء`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'main',
    header: 'قبر عمر بن الخطاب',
    description: `السلام عليك يا عمر
    السلام عليك يا فاروق الامة
    السلام عليك يا ثاني الخلفاء الراشدين
    جزاك الله عنا وعن الإسلام والمسلمين خير الجزاء`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  // ...Madina,
  {
    place: 'hotelMadina',
    title: 'moves',
    header: 'العودة للفندق',
    description: null,
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/RaTsD5MgpJppyR4ZA',
  },
  {
    place: 'elMasgedElNabawy',
    title: 'pray',
    header: 'التوجه للمسجد النبوي لصلاة المغرب',
    description: null,
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/dkcPfdULbd7BCGhG7',
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء دخول المسجد',
    description: `بسم الله والصلاة والسلام على رسول الله،
    أعوذ بالله العظيم وبوجهه الكريم
    وسلطانه القديم من الشيطان الرجيم
    اللهم افتح لي أبواب رحمتك`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'pray',
    header: 'المكوث حتي صلاة العشاء',
    description: 'الدعاء لله وقراءة القرءان',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'ذكر',
    description: `عَنْ أُبَيِّ بْنِ كَعْبٍ رضي الله عنه قَالَ :
      قُلْتُ : يَا رَسُولَ اللَّهِ إِنِّي أُكْثِرُ الصَّلَاةَ عَلَيْكَ فَكَمْ أَجْعَلُ لَكَ مِنْ صَلَاتِي ؟
      فَقَالَ : مَا شِئْتَ . قَالَ قُلْتُ الرُبُعَ ؟
      قَالَ : مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ . قُلْتُ النِّصْفَ ؟
      قَالَ : مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ . قَالَ قُلْتُ فَالثُّلُثَيْنِ ؟
      قَالَ : مَا شِئْتَ فَإِنْ زِدْتَ فَهُوَ خَيْرٌ لَكَ . قُلْتُ أَجْعَلُ لَكَ صَلَاتِي كُلَّهَا ؟
      قَالَ : إِذًا تُكْفَى هَمَّكَ وَيُغْفَرُ لَكَ ذَنْبُكَ`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'pray',
    header: 'صلاة العشاء والسنن',
    description: 'صلاة العشاء والسنة',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'hotelMadina',
    title: 'moves',
    header: 'الرجوع للفندق',
    description: null,
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/RaTsD5MgpJppyR4ZA',
  },
  {
    place: 'elMasgedElNabawy',
    title: 'pray',
    header: 'التوجة للمسجد النبوي لصلاة القيام',
    description: 'قيام 24 ركعة ان شاء الله و قراءة القران',
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/dkcPfdULbd7BCGhG7',
  },
  {
    place: 'hotelMadina',
    title: 'sonna',
    header: 'سنة',
    description: 'التطهر فى الفندق لصلاة القيام و نية صلاة ركعتين فى قباء',
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/RaTsD5MgpJppyR4ZA',
  },
  {
    place: null,
    title: 'zikr',
    header: 'ذكر',
    description:
      'آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ (285) لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ (286)',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'ايه الكرسي',
    description:
      'اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى null البقرة 255].  (من قالها حين يصبح أجير من الجن حتى يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح.)',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'المعوذتان والفاتحة',
    description:
      'قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.  (من قالها حين يصبح وحين يمسى كفته من كل شىء (الإخلاص والمعوذتين).)',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'elMasgedElNabawy',
    title: 'pray',
    header: 'صلاة الفجر',
    description: 'السنة القبلية و صلاة الفجر',
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/7Aj6QTuhhdCKDJKT7',
  },
  {
    place: 'qebaa',
    title: 'main',
    header: 'التوجه لمسجد قباء',
    description: 'قال رسول الله : من تطهر في بيته ثم أتى مسجد قباء فصلى فيه ركعتين كان كعمرة',
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/Er1cmeBJYBSe7yiB9',
  },
  {
    place: null,
    title: 'zikr',
    header: 'اذكار الصباح',
    description: `أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله
    لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، لهُ المُـلكُ ولهُ الحَمْـد وهُوَ على كلّ شَيءٍ قدير
    رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه
    وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه
    رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر
    رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'اذكار الصباح',
    description: `اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ، خَلَقْتَنـي وَأَنا عَبْـدُك
    وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت
    أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت
    أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي
    فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'اذكار الصباح',
    description: `رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً
    (من قالها حين يصبح وحين يمسى كان حقا على الله أن يرضيه يوم القيامة.)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'اذكار الصباح',
    description: `اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك
    وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك
    أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك
    وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك
    (من قالها أعتقه الله من النار.)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'اذكار الصباح',
    description: `حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم
    (من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'اذكار الصباح',
    description: `اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك
    فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك
    فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر
    (من قالها حين يصبح أدى شكر يومه.)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'hotelMadina',
    title: 'moves',
    header: 'الرجوع للنفدق',
    description: null,
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/RaTsD5MgpJppyR4ZA',
  },
  {
    place: 'elMasgedElNabawy',
    title: 'pray',
    header: 'التوجة للمسجد النبوي لصلاة االجمعة',
    description: null,
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/dkcPfdULbd7BCGhG7',
  },
  {
    place: 'hotelMadina',
    title: 'hotel',
    header: 'الرجوع للفندق ولبس الاحرام وتسجيل الخروج',
    description: 'لبس ملابس الاحرام و عقد نية الاحرام والعمرة',
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/RaTsD5MgpJppyR4ZA',
  },
  {
    place: 'hotelMadina',
    title: 'main',
    header: null,
    description: 'الاغتسال للاحرام سنة والتطيب على الجسد لا على ملابس الاحرام',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'hotelMadina',
    title: 'zikr',
    header: 'الذكر عند الاحرام',
    description: 'سُبْحَانَ اللهِ وَالحَمْدُ للهِ وَالله أَكْبَرُ',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: 'hotelMadina',
    title: 'main',
    header: null,
    description: `لا يقص الشعر و لا التطيب ولا قص الاظافر ولا تغطي الراس بالاحرام
    لا يجوز قطع ورقة شجرة او نبته ولا يجوز ترويع الطير او اصطيادها
    اذا وجدت شي بالارض فى الحرم اتركه كما هو`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: 'out',
    title: 'moves',
    header: 'التوجه لمحطة القطار',
    description: null,
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/ymtJiuTnuceaFAZW6',
  },

  {
    place: null,
    title: 'main',
    header: 'الدُّعاءُ بينَ الرُّكن اليماني والحجر الأسود',
    description: 'رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللهم انت ربي لا اله الا انت
    خلقتني وانا عبدك
    وانا على عهدك ووعدك ما استطعت
    اعوذ بك من شر ما صنعت
    ابوء لك بنعمتك علي
    وابوء بذنبي
    فاغفر لي فانه لا يغفر الذنوب الا انت`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `لا اله الا الله الحليم الكريم
       سبحان رب العرش العظيم الحمد لله رب العالمين
       اللهم اني اسالك موجبات رحمتك
       وعزائم مغفرتك والغنيمه من كل بر والسلامه من كل اثم
       اللهم لا تدع لي ذنبا الا غفرته ولا هما الا فرجته
       ولا حاجه هي لك رضا الا قضيتها يا رب العالمين يا ارحم الراحمين`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللهم لك الحمد انت نور السماوات والارض ومن فيهن
    ولك الحمد انت قيوم السماوات والارض ومن فيهن
    ولك الحمد انت الحق و وعدك حق وقولك حق والجنه حق والنار حق
    والساعه حق والنبيون حق ومحمد حق
    اللهم لك اسلمت و عليك توكلت
    وبك امنت واليك انبت
    فاغفر لي ما قدمت وما اخرت
    وما اسررت وما اعلنت
    انت المقدم وانت المؤخر لا اله الا انت`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'اللهم لك الحمد كله واليك يرجع الامر كله علانيته وسره فانت حق من يعبد وانت حق من يحمد وانت على كل شيء قدير',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللهم لك اسلمت وعليك توكلت
    وبك امنت واليك انبت وبك خاصمت واليك حاكمت
    فاغفر لي ما قدمت وما اخرت وما اسررت وما اعلنت`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `الحمد لله الذي من علينا بالاسلام الحمد لله رب العالمين
      الحمد لله الذي له ما في السماوات وما في الارض
      وله الحمد في الدنيا وفي الاخره وهو الحكيم الخبير`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ
      وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ، عَاجِلِهِ وَآَجِلِهِ مَا عَلِمْتُ مِنْهُ، وَمَا لَمْ أَعْلَمْ
      اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ
      وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ
      اللهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
      وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
      وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ تَقْضِيهِ لِي خَيْرًا`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ. [الأنبياء null 87].',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِه مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ
    وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ عَاجِلِهِ وَآَجِلِهِ مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَمْ
    اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ
    وَأَعُوذُ بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ
    اللهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ تَقْضِيهِ لِي خَيْرًا`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'لا ننسي الدعاء للاهل وذوي القربي والاصحاب بصلاح الحال والتوفيق والهداية وطلب الشفاء للمريض و طلب الرحمة للمتوفي',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: null,
    title: 'main',
    header: 'مناسك',
    description: 'لابد من تغطية الكتف وبعد الطواف',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'main',
    header: 'مناسك',
    description: 'صلاة ركعتين فى مقام ابراهيم',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'main',
    header: 'مناسك',
    description: 'فى الركعة الاولي سورة الكافرون والثانية الاخلاص',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'main',
    header: 'الدعاء بعد ركعتي الطواف',
    description:
      'لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ، لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، بِيَدِهِ الْخَيْرُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: 'out',
    title: 'moves',
    header: 'اجراءات دخول مطار وصعود الطيارة',
    description: null,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: 'moves',
    header: 'اجراءات الدخول والخروج من المطار',
    description: null,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: 'doaa',
    header: 'دعاء السفر',
    description: `الله اكبر الله اكبر الله اكبر
      سبحان الذي سخر لنا هذا وما كنا له مقرنين
      وانا الى ربنا لمنقلبون
      اللهم انا نسالك في سفرنا هذا البر والتقوى ومن العمل ما ترضى
      اللهم هون علينا سفرنا هذا واطوي عنا بعده
      اللهم انت الصاحب السفر والخليفه في الاهل اللهم
      اني اعوذ بك من وعثاء السفر وكابه المنظر
      وسوء المنقلب في المال والاهل`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: 'moves',
    header: 'قطار الحرمين للمدينة الساعة 8 الي 9.54',
    description: 'تجديد النية لاداء مناسك العمرة خالصة لله و زيارة مسجد رسول الله',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: 'moves',
    header: 'محطة القطار بالمدينة',
    description: '',
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/9jFeutNU72ojRLVN9',
  },
  {
    place: 'out',
    title: 'main',
    header: 'اثناء الرحلة بعد التحرك بربع ساعه',
    description: 'عند المرور بابيار علي عقد النية على العمرة ثم التلبية حتي الوصول',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: 'main',
    header: null,
    description: 'الجهر بنية العمرة',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: 'main',
    header: null,
    description: 'لبيك اللهم عمرة فان حبسني حابس فمحلي حيث حبستني',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: 'main',
    header: 'الجهر بالتلبية حتي دخول مكة',
    description: 'لبيك اللهم لبيك لبيك لا شريك لك لبيك ان الحمد والنعمة لك والملك لا شريك لك',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: 'out',
    title: 'main',
    header: null,
    description: 'التلبية تتوقف عند دخول مكة او دخول الحرم',
    status: 'active',
    image: null,
    link: null,
    location: 'https://goo.gl/maps/qLjszSf2A9YucFWJA',
  },
  {
    place: 'hotellMakka',
    title: 'moves',
    header: 'التوجه للفندق بمكة وتسجيل الدخول',
    description: 'يجوز الاغستال مرة اخرى عند دخول مكة وفعل الرسول هذا',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: 'elMasgedElHaram',
    title: 'doaa',
    header: 'عند الدخول للحرم نقول',
    description: `بسم الله والصلاة والسلام على رسول الله،
    أعوذ بالله العظيم وبوجهه الكريم
    وسلطانه القديم من الشيطان الرجيم
    اللهم افتح لي أبواب رحمتك`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللهم صل على محمد وعلى آل محمد كما
      صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد
      اللهم بارك على محمد وعلى آل محمد كما
      باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'اللهم انا نسألك رضاك والجنة ونعوذ بك من سخطك والنار',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في الدُّنْـيا وَالآخِـرَة
    اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني وَدُنْـيايَ وَأهْـلي وَمالـي
    اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ، اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي
    وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ، وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ، وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ
    مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ
    وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ , أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ
    وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي
    وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'ذكر',
    description: `لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ
      عدد 100 مرة (كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'ذكر',
    description: `سُبْحـانَ اللهِ وَبِحَمْـدِهِ
    (حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ.
    لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'zikr',
    header: 'ذكر',
    description: `أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ
      (مائة حسنة، ومُحيت عنه مائة سيئة، وكانت له حرزاً من الشيطان حتى يمسى)`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },

  {
    place: 'elMasgedElHaram',
    title: 'doaa',
    header: 'الدعاء عند رؤية الكعبة',
    description: 'اللهُمَّ أَنْتَ السَّلَامُ وَمِنْكَ السَّلَامُ، فَحَيِّنَا رَبَّنَا بِالسَّلَامِ',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللَّهُمَّ إِنِّي أَسْأَلُكَ بِاسْمِكَ الأَعْظَمِ ، الَّذِي إِذَا دُعِيتَ بِهِ أَجَبْتَ ،
      وَإِذَا سُئِلْتَ بِهِ أَعْطَـيْتَ
      أَسْأَلُكَ بِأَنِّي أَشُهَدُ أَنَّكَ أَنْتَ اللهُ لا إِلَهَ إِلاَّ أَنْتَ ،
      الأَحَدُ الصَّمَدُ الَّذِي لَمْ يَلِدْ، وَلَمْ يَولَدْ ، وَلَمْ يَكُنْ لَهُ كُفُوًا أَحَدٌ
      أَنْ تَغْفِرَ لِي ذُنُوبِي ، إِنَّكَ أَنْتَ الغَفُورُ الرَّحِيمُ`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `اللَّهُم اغْفِرْ لِي خَطِيئَتِي وَجَهْلِي ، وَإِسْرَافِي فِي أَمْرِي ،
    وَمَا أَنْتَ أَعْـلَمُ بِهِ مِنّـِي
    اللَّهُمَّ اغْفِرْ لِي هَزْلِي وَجِدِّي ، وَخَطَئِي وَعَمْدِي ، وَكُلُّ ذَلِكَ عِنْدِي`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description:
      'اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلاَّ أَنْتَ خَلَقْتَنِي وَأَنَا عَبْدُكَ ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَااسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ وَأَبُوءُ لَكَ بِذَنْبِي فَاغْفِرْ لِي فَإنَّهُ لا يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description:
      'اللَّهُمَّ يَا مَنْ لا تَضُرُّهُ الذُّنُوبُ ، وَلا تُنْقِصُهُ المَغْفِرَةُ ، اغْفِرْ لَنَا مَا لا يَضُرُّكَ ، وَهَبْ لَنَا مَالا يُنْقِصُكَ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلّهُ ، دِقَّهُ وَجُلَّهُ ، وَأَوَّلَهُ وَآخِرَهَ ، وَعَلاَنِيَتَهَ وَسِرَّهُ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'أَرِنَا الحَقَّ حقَّاً وَارْزُقْنَا اتِّبَاعَهُ، وَأَرِنَا البَاطِلَ بَاطِلاً وَارْزُقْنَا اجْتِنَابَهُ.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'آتِ نَفْسِي تَقْوَاهَا ، وَزَكِّهَا أَنْتَ خَيْرُ مَنْ زَكَّاهَا، أَنْتَ وَلِيُّهَا وَمَوْلاهَا.',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `إِنِّي عَبْدُكَ ابْنُ عَبْدِكَ ابْنُ أَمَتِكَ ، نَاصِيَتِي بِيَدِكَ ، مَاضٍ فِيَّ حُكْمُكَ ، عَدْلٌ فِيَّ قَضَاؤكَ
    أَسْأَلُكَ بِكُلِّ اسْمٍ هُوَ لَكَ ، سَمَّيتَ بِهِ نَفْسَكَ ، أَوْ أَنْزَلْتَهُ فِي كِتَابِكَ ، أَوْ عَلَّمْتَهُ أَحَداً مِنْ خَلْقِكَ
    أَوْ اسْتَأْثَرْتَ بِهِ فِي عِلْمِ الغَيبِ عِنْدَك
    أَنْ تَجْعَلَ القُرْآنَ رَبِيعَ قَلْبِي ، وَنُورَ صَدْرِي ، وَجَلاءَ حَزَنِي ، وَذَهَابَ هَمِّي`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: 'لَّا إِلَهَ إِلَّا أَنتَ سُبْحَانَكَ إِنِّي كُنتُ مِنَ الظَّالِمِينَ". [الأنبياء 87].',
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
  {
    place: null,
    title: 'doaa',
    header: 'دعاء',
    description: `عَنْ عَائِشَةَ رضي الله عنها
    أَنَّ رَسُولَ اللهِ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، عَلَّمَهَا هَذَا الدُّعَاءَ
    اللهُمَّ إِنِّي أَسْأَلُكَ مِنَ الْخَيْرِ كُلِّهِ عَاجِلِهِ وَآجِلِهِ، مَا عَلِمْتُ مِنْهُ وَمَا لَمْ أَعْلَم
    وَأَعُوذُ بِكَ مِنَ الشَّرِّ كُلِّهِ، عَاجِلِهِ وَآَجِلِهِ مَا عَلِمْتُ مِنْهُ، وَمَا لَمْ أَعْلَمْ
    اللهُمَّ إِنِّي أَسْأَلُكَ مِنْ خَيْرِ مَا سَأَلَكَ عَبْدُكَ وَنَبِيُّكَ مُحَمَّدٌ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ
    بِكَ مِنْ شَرِّ مَا عَاذَ مِنْهُ عَبْدُكَ وَنَبِيُّكَ
    اللهُمَّ إِنِّي أَسْأَلُكَ الْجَنَّةَ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَعُوذُ بِكَ مِنَ النَّارِ وَمَا قَرَّبَ إِلَيْهَا مِنْ قَوْلٍ أَوْ عَمَلٍ
    وَأَسْأَلُكَ أَنْ تَجْعَلَ كُلَّ قَضَاءٍ تَقْضِيهِ لِي خَيْرًا`,
    status: 'active',
    image: null,
    link: null,
    location: null,
  },
]

function uniqueStrings(arr) {
  return [...new Set(arr)];
}

Zikr = Zikr.map((item, index) => item.description).filter(Boolean)

Zikr = uniqueStrings(Zikr)
fs.writeFileSync(
  './Data.json',
  JSON.stringify(Zikr, null, 2)
)
